Revit 2026 API

# ScheduleFieldSetStyle Method

---

Sets the style of this field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetStyle(
	TableCellStyle style
)
```
```vb
Public Sub SetStyle (
	style As TableCellStyle
)
```
```cpp
public:
void SetStyle(
	TableCellStyle^ style
)
```
```fsharp
member SetStyle :
        style : TableCellStyle -> unit
```

#### Parameters

style TableCellStyle

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace